// 防止头文件重复包含（固定格式）
#ifndef _USER_CONFIG_OVERRIDE_H_
#define _USER_CONFIG_override_H_

/******************************************************************
 * 【必须】配置版本号
 * 每次修改这里 +1，强制设备刷新配置
 ******************************************************************/
#undef CFG_HOLDER
#define CFG_HOLDER  888666

/******************************************************************
 * 【核心】开机自动执行命令
 * 新版 Tasmota 唯一能让 GPIO 自动生效的方法！
 ******************************************************************/
#undef USER_BACKLOG
#define USER_BACKLOG \
"Module 0;" \
"Template {\"NAME\":\"ESP32C3\",\"GPIO\":[0,0,0,0,0,576,0,0,0,32,0,0,0,0,0,0,0,0,1056,1088,0,0],\"FLAG\":0,\"BASE\":1};" \
"Restart 1"

/******************************************************************
 * 强制使用自定义模板
 ******************************************************************/
#undef MODULE
#define MODULE 0

/******************************************************************
 * 解锁串口命令（解决你发命令没反应）
 ******************************************************************/
#define SERIAL_CONSOLE_INPUT 1

#endif
